app/controllers/api/v1/base.rb

       # ActiveStorage::Current.host = request.base_url
      auth_optional = route&.settings&.dig(:authentication, :optional)
      if auth_optional
        auth_key = ApiToken.find_by(token: bearer_token)
---
SELECT "api_tokens".* FROM "api_tokens" WHERE "api_tokens"."token" = $1 LIMIT $2  [["token", "[FILTERED]"], ["LIMIT", 1]]

      def authenticated!
        auth_key = ApiToken.find_by(token: bearer_token)
---
SELECT "api_tokens".* FROM "api_tokens" WHERE "api_tokens"."token" = $1 LIMIT $2  [["token", "[FILTERED]"], ["LIMIT", 1]]