app/controllers/api/v1/user_auths.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ati_bangladesh@gmail.com"], ["LIMIT", 1]]
---
        end
        route_setting :authentication, optional: true
        post 'login' do
          @user = User.find_by(email: params[:email])

INSERT INTO "api_tokens" ("user_id", "token", "active", "expired_at", "created_by_id", "updated_by_id", "created_by_type", "updated_by_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
          error!('Invalid email or password', 401) unless @user.present?
          error!('Invalid email or password', 401) unless @user&.authenticate(params[:password])

          api_token = ApiToken.create!(user: @user)

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Ati raju"], ["email", "ati_bangladesh@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2024-06-16 05:44:39.606273"], ["updated_at", "2024-06-16 05:44:39.606273"]]
---
        end
        route_setting :authentication, optional: true
        post 'registration' do
          user = User.create!(declared(params, include_missing: false).except(:confirm_password))